// // Создаем массив из нескольких чисел
let arr = [10, 12, 15, 13];

// // Выводим в консоль длину массива
// console.log(arr.length);

// // Обьединяем элементы массива в строку методом join(), выводим в консоль
// console.log(arr.join(", "));

// // Сортируем элементы массива методом sort(), выводим в консоль
// console.log(arr.sort());

// // Переворачиваем элементы массива в обратном порядке методом reverse(), выводим в консоль
// console.log(arr.reverse());

// Используем ранее изученные методы и разбиваем строку методом split()
let str = arr.reverse() .join(", ");
console.log(str.split(", "));